34. Clase/03.artillery/config.yml
config:
  plugins:
    metrics-by-endpoint: {}
  target: 'http://localhost:8080'
  phases:
    - duration: 20
      arrivalRate: 10
scenarios:
  - name: "Sessions Flow (register + login)"
    flow:
      - log: "1. Creamos variables para el usuario"
      - get:
          url: '/api/test/user'
          capture:
            - json: "$.first_name"
              as: "first_name"
            - json: "$.last_name"
              as: "last_name"
            - json: "$.email"
              as: "email"
            - json: "$.password"
              as: "password"
      - log: "Registramos al usuario"
      - post:
          url: '/api/sessions/register'
          json: #tomamos los datos del test
            first_name: "{{ first_name }}"
            last_name: "{{ last_name }}"
            email: "{{ email }}"
            password: "{{ password }}"
      - think: 2
      - log: "Login de usuario"
      - post:
          url: "/api/sessions/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"